ncpeh-simulation-mock/src/test/resources/de/gematik/ncpeh/api/mock/builder/RetrieveDocumentSetRequest.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?><!--
  ~ Copyright (c) 2024-2025 gematik GmbH
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the License is distributed on an "AS IS" BASIS,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the License for the specific language governing permissions and
  ~ limitations under the License.
  -->

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <RetrieveDocumentSetRequest xmlns="urn:ihe:iti:xds-b:2007">
      <DocumentRequest>
        <HomeCommunityId>urn:oid:1.2.276.0.76.4.291</HomeCommunityId>
        <RepositoryUniqueId>2.16.620.1.101.10.3.29.54290</RepositoryUniqueId>
        <DocumentUniqueId>2.16.17.710.813.1000.990.1.1^PS.XML</DocumentUniqueId>
      </DocumentRequest>
      <DocumentRequest>
        <HomeCommunityId>urn:oid:1.2.276.0.76.4.291</HomeCommunityId>
        <RepositoryUniqueId>2.16.620.1.101.10.3.29.54290</RepositoryUniqueId>
        <DocumentUniqueId>2.16.17.710.813.1000.990.1.1^PS.PDF</DocumentUniqueId>
      </DocumentRequest>
    </RetrieveDocumentSetRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>